bckenne@Ghost:~/Dropbox/352/sde3$ prolog
Welcome to SWI-Prolog (Multi-threaded, 64 bits, Version 6.6.6)
Copyright (c) 1990-2013 University of Amsterdam, VU Amsterdam
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software,
and you are welcome to redistribute it under certain conditions.
Please visit http://www.swi-prolog.org for details.

For help, use ?- help(Topic). or ?- apropos(Word).

?- ['test.pro'].
% test.pro compiled 0.00 sec, 12 clauses
true.

?- startup.
% motion.pro compiled 0.00 sec, 32 clauses
true.

?- image_tgr11(A),printImage(A).
0 0 0 20 0 
0 10 10 0 0 
0 10 10 0 0 
0 0 0 0 0 
0 0 0 0 0 
A = [[0, 0, 0, 20, 0], [0, 10, 10, 0, 0], [0, 10, 10, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0|...]].

?- image_tgr12(A),printImage(A).
0 0 0 0 0 
0 10 10 0 0 
0 10 10 0 0 
0 20 0 0 0 
0 0 0 0 0 
A = [[0, 0, 0, 0, 0], [0, 10, 10, 0, 0], [0, 10, 10, 0, 0], [0, 20, 0, 0, 0], [0, 0, 0, 0|...]].

?- image_tgr11(A),image_tgr12(B),diffIm(A,B,C).
A = [[0, 0, 0, 20, 0], [0, 10, 10, 0, 0], [0, 10, 10, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0|...]],
B = [[0, 0, 0, 0, 0], [0, 10, 10, 0, 0], [0, 10, 10, 0, 0], [0, 20, 0, 0, 0], [0, 0, 0, 0|...]],
C = [[0, 0, 0, -20, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0, 0], [0, 20, 0, 0, 0], [0, 0, 0, 0|...]].

?- image_tgr11(A),image_tgr12(B),diffIm(A,B,C),printImage(C).
0 0 0 -20 0 
0 0 0 0 0 
0 0 0 0 0 
0 20 0 0 0 
0 0 0 0 0 
A = [[0, 0, 0, 20, 0], [0, 10, 10, 0, 0], [0, 10, 10, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0|...]],
B = [[0, 0, 0, 0, 0], [0, 10, 10, 0, 0], [0, 10, 10, 0, 0], [0, 20, 0, 0, 0], [0, 0, 0, 0|...]],
C = [[0, 0, 0, -20, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0, 0], [0, 20, 0, 0, 0], [0, 0, 0, 0|...]].

?- image_tgr11(A),image_tgr12(B),isDiff(A,B).
A = [[0, 0, 0, 20, 0], [0, 10, 10, 0, 0], [0, 10, 10, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0|...]],
B = [[0, 0, 0, 0, 0], [0, 10, 10, 0, 0], [0, 10, 10, 0, 0], [0, 20, 0, 0, 0], [0, 0, 0, 0|...]].

?- image_tgr11(A),image_tgr12(B),isDiff(A,B).
A = [[0, 0, 0, 20, 0], [0, 10, 10, 0, 0], [0, 10, 10, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0|...]],
B = [[0, 0, 0, 0, 0], [0, 10, 10, 0, 0], [0, 10, 10, 0, 0], [0, 20, 0, 0, 0], [0, 0, 0, 0|...]].

?- image_tgr11(A),image_tgr11(B),isDiff(A,B).
false.

?- image_tgr11(A),image_tgr11(B),diffIm(A,B,C),mask(A,B,C,MN,MP).
A = B, B = [[0, 0, 0, 20, 0], [0, 10, 10, 0, 0], [0, 10, 10, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0|...]],
C = MN, MN = MP, MP = [[0, 0, 0, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0|...]].

?- image_tgr11(A),image_tgr12(B),diffIm(A,B,C),mask(A,B,C,MN,MP).
A = [[0, 0, 0, 20, 0], [0, 10, 10, 0, 0], [0, 10, 10, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0|...]],
B = [[0, 0, 0, 0, 0], [0, 10, 10, 0, 0], [0, 10, 10, 0, 0], [0, 20, 0, 0, 0], [0, 0, 0, 0|...]],
C = [[0, 0, 0, -20, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0, 0], [0, 20, 0, 0, 0], [0, 0, 0, 0|...]],
MN = [[0, 0, 0, 20, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0|...]],
MP = [[0, 0, 0, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0, 0], [0, 20, 0, 0, 0], [0, 0, 0, 0|...]].

?- image_tgr11(A),image_tgr12(B),diffIm(A,B,C),mask(A,B,C,MN,MP),
|    
|    printImage(MN),printImage(MP).
0 0 0 20 0 
0 0 0 0 0 
0 0 0 0 0 
0 0 0 0 0 
0 0 0 0 0 
0 0 0 0 0 
0 0 0 0 0 
0 0 0 0 0 
0 20 0 0 0 
0 0 0 0 0 
A = [[0, 0, 0, 20, 0], [0, 10, 10, 0, 0], [0, 10, 10, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0|...]],
B = [[0, 0, 0, 0, 0], [0, 10, 10, 0, 0], [0, 10, 10, 0, 0], [0, 20, 0, 0, 0], [0, 0, 0, 0|...]],
C = [[0, 0, 0, -20, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0, 0], [0, 20, 0, 0, 0], [0, 0, 0, 0|...]],
MN = [[0, 0, 0, 20, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0|...]],
MP = [[0, 0, 0, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0, 0], [0, 20, 0, 0, 0], [0, 0, 0, 0|...]].

?- image_mn1k(MN),centImRow(MN,1,CIR1).
MN = [[0, 0, 0, 20, 0], [0, 0, 0, 15, 0], [0, 0, 0, 10, 0], [0, 0, 0, 5, 0], [0, 0, 0, 0|...]],
CIR1 = 200.

?- image_mn1k(MN),centImCol(MN,1,CIC1).
MN = [[0, 0, 0, 20, 0], [0, 0, 0, 15, 0], [0, 0, 0, 10, 0], [0, 0, 0, 5, 0], [0, 0, 0, 0|...]],
CIC1 = 100.

?- image_mp1k(MP),centImCol(MP,1,CIR2).
MP = [[0, 0, 0, 0, 0], [0, 20, 0, 0, 0], [0, 15, 0, 0, 0], [0, 10, 0, 0, 0], [0, 5, 0, 0|...]],
CIR2 = 150.

?- image_mp1k(MP),centImCol(MP,1,CIC2).
MP = [[0, 0, 0, 0, 0], [0, 20, 0, 0, 0], [0, 15, 0, 0, 0], [0, 10, 0, 0, 0], [0, 5, 0, 0|...]],
CIC2 = 150.

?- image_tgr11(T1),image_tgr12(T2),motion(T1,T2,Moti,Motj).
T1 = [[0, 0, 0, 20, 0], [0, 10, 10, 0, 0], [0, 10, 10, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0|...]],
T2 = [[0, 0, 0, 0, 0], [0, 10, 10, 0, 0], [0, 10, 10, 0, 0], [0, 20, 0, 0, 0], [0, 0, 0, 0|...]],
Moti = 3.0,
Motj = -2.0.

?- image_i1cr(T1),image_i2cr(T2),motion(T1,T2,Moti,Motj).
T1 = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 1, 2, 2, 2, 1|...], [2, 5, 4, 3, 2, 2|...], [2, 5, 4, 3, 2|...], [2, 3, 3, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...],
T2 = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 1, 2, 2, 2, 1|...], [2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2|...], [2, 2, 2, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...],
Moti = 1.0,
Motj = 5.0.

?- image_tgr21(T1),image_tgr22(T2),motion(T1,T2,Moti,Motj).
T1 = [[0, 0, 0, 10, 0], [0, 0, 0, 10, 10], [0, 0, 0, 10, 10], [0, 0, 0, 10, 0], [0, 0, 0, 0|...]],
T2 = [[0, 0, 0, 0, 0], [0, 10, 0, 0, 0], [0, 10, 10, 0, 0], [0, 10, 10, 0, 0], [0, 10, 0, 0|...]],
Moti = 1.0,
Motj = -1.9999999999999996.

?- image_tgr31(T1),image_tgr32(T2),motion(T1,T2,Moti,Motj).
T1 = [[5, 5, 0, 5, 0], [0, 0, 0, 10, 9], [0, 0, 0, 8, 0], [0, 0, 0, 7, 0], [5, 4, 3, 2|...]],
T2 = [[5, 5, 0, 5, 0], [0, 10, 9, 0, 0], [0, 8, 0, 0, 0], [0, 7, 0, 0, 0], [5, 4, 3, 2|...]],
Moti = 0.0,
Motj = -2.0.

?- image_tgr31(T1),image_tgr31(T2),motion(T1,T2,Moti,Motj).
***** No Motion in This Case *****
T1 = T2, T2 = [[5, 5, 0, 5, 0], [0, 0, 0, 10, 9], [0, 0, 0, 8, 0], [0, 0, 0, 7, 0], [5, 4, 3, 2|...]].

?- 
% halt

